<script lang="ts">
    import img from "$lib/images/Union.svg";
</script>

<div class="grid relative mx-3 md:mx-14 lg:mx-16 xl:mx-28 mt-24 font-montserrat font-normal text-[#A7C9E9]">
    <svg height="0" width="0">
        <defs>
            <clipPath id="path" clipPathUnits="objectBoundingBox">
            <path d="M0.494,0.953 C0.494,0.953,0.495,0.952,0.495,0.952 V0.64 C0.493,0.628,0.489,0.624,0.473,0.621 H0.495 C0.494,0.621,0.494,0.621,0.494,0.621 C0.494,0.621,0.494,0.621,0.494,0.621 H0.044 C0.043,0.621,0.042,0.622,0.042,0.623 C0.038,0.631,0.031,0.636,0.022,0.636 C0.01,0.636,0,0.626,0,0.612 C0,0.599,0.01,0.588,0.022,0.588 C0.032,0.588,0.04,0.596,0.043,0.605 C0.043,0.606,0.043,0.606,0.044,0.606 H0.484 L0.472,0.606 C0.487,0.603,0.492,0.601,0.495,0.587 V0.236 C0.492,0.22,0.489,0.219,0.473,0.217 H0.044 C0.043,0.217,0.042,0.217,0.042,0.218 C0.039,0.226,0.031,0.232,0.022,0.232 C0.01,0.232,0,0.222,0,0.208 C0,0.195,0.01,0.184,0.022,0.184 C0.032,0.184,0.04,0.191,0.043,0.201 C0.043,0.201,0.043,0.201,0.044,0.201 H0.481 C0.489,0.198,0.492,0.193,0.494,0.179 L0.494,0.201 H0.494 L0.494,0.201 C0.494,0.201,0.495,0.201,0.495,0.201 V0.008 C0.495,0.003,0.498,0,0.501,0 C0.505,0,0.508,0.003,0.508,0.008 V0.265 C0.508,0.281,0.52,0.293,0.534,0.293 H0.956 C0.957,0.293,0.957,0.293,0.957,0.292 C0.96,0.282,0.968,0.275,0.978,0.275 C0.99,0.275,1,0.286,1,0.299 C1,0.313,0.99,0.323,0.978,0.323 C0.969,0.323,0.962,0.318,0.958,0.309 C0.958,0.309,0.957,0.308,0.956,0.308 H0.534 C0.52,0.308,0.508,0.321,0.508,0.336 V0.687 C0.508,0.702,0.52,0.715,0.534,0.715 H0.956 C0.956,0.715,0.957,0.715,0.957,0.715 C0.957,0.715,0.957,0.715,0.957,0.714 C0.96,0.704,0.968,0.697,0.978,0.697 C0.99,0.697,1,0.708,1,0.721 C1,0.734,0.99,0.745,0.978,0.745 C0.969,0.745,0.962,0.739,0.958,0.731 C0.958,0.73,0.957,0.73,0.956,0.73 H0.534 C0.52,0.73,0.508,0.742,0.508,0.758 V0.952 C0.508,0.953,0.509,0.954,0.51,0.954 C0.517,0.958,0.522,0.967,0.522,0.976 C0.522,0.989,0.512,1,0.5,1 C0.488,1,0.478,0.989,0.478,0.976 C0.478,0.965,0.485,0.956,0.494,0.953 M0.494,0.606 C0.494,0.606,0.494,0.606,0.494,0.606 C0.494,0.606,0.494,0.606,0.494,0.606 H0.494">
            </path>
            </clipPath>
        </defs>
    </svg>
    <h1 class="text-center text-4xl lg:text-5xl xl:text-6xl 2xl1:text-8xl">Возможности</h1>
    <div class="grid grid-cols-[5fr_3fr_5fr] sm:grid-cols-[2fr_3fr_2fr] text-base gap-2 sm:gap-5 mt-5 md1:text-lg lg:text-xl xl:text-2xl  2xl1:text-4xl">
        <div class="text-start">
            <p>Разработка Fron-end части на сайта на React</p>
            <p class="mt-8">Разработка Back-end части сайта на Django или Kotlin</p>
        </div>
        <div class="clip relative w-full h-full overflow-hidden flex justify-center">
            <div class="pulse absolute border-solid border-[20px] blur-xl border-black rounded-b-3xl size-0 -top-14" />
        </div>
        <div class="text-end">
            <p>Разработка и поддержка мобильных приложений на Android Studio или Kotlin</p>
            <p class="mt-8">Обеспечение мониторинга серверов и их поддержка</p>
        </div>
    </div>
    <p class="text-base justify-self-center text-center w-72 lg:w-96 md:text-lg lg:text-xl xl:text-2xl 2xl1:text-4xl">Разработка дизайна от логотипов до страниц сайтов</p>
</div>

<style>
    .clip{
        @apply bg-white;
        clip-path: url(#path);
    }

    .pulse{
        animation: 3s linear 1s pulse-animation infinite;
    }
    
    @keyframes pulse-animation {
        30% {
            width: 130vh;
            height: 130vh;
        }
        to {
            width: 130vh;
            height: 130vh;
        }
    }
</style>